---
title: BoundingBoxUV
classe: Autodesk.Revit.DB.BoundingBoxUV
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# BoundingBoxUV

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `UV Bounds { get; }` | `boundingBoxUV.Bounds` | UV |
| `Boolean IsSet { get; }` | `boundingBoxUV.IsSet` | Boolean |
| `UV Max { get; set; }` | `boundingBoxUV.Max` | UV |
| `UV Min { get; set; }` | `boundingBoxUV.Min` | UV |
| `Void Dispose()` | `boundingBoxUV.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```